/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : นับจำนวนข้อมูล product
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
countProduct {
	SELECT 
		COUNT(1) AS TOT
	FROM PRODUCT P
	INNER JOIN PRODUCT_TYPE PT ON P.TYPE_ID = PT.TYPE_ID
	WHERE P.TYPE_ID = %s
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นหาข้อมูล product
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchProduct {
	SELECT
		P.ID
		, P.CODE
		, P.PRODUCT_DESC
		, P.PRICE
		, P.STOCK_NUM
		, CONCAT(PT.IMAGE_PATH, '', P.IMAGE_NAME) AS IMAGE
		, P.IMAGE_NAME
		, PT.IMAGE_PATH
		, PT.TYPE_ID
		, PT.TYPE_DESC
		, PT.SEQ
	FROM PRODUCT P
	INNER JOIN PRODUCT_TYPE PT ON P.TYPE_ID = PT.TYPE_ID
	WHERE P.TYPE_ID = %s
	ORDER BY P.CODE
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นหารายสินค้าที่จะสั่งซื้อ
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchProductByIds {
	SELECT
		P.ID
		, P.CODE
		, CONCAT(PT.IMAGE_PATH, '', P.IMAGE_NAME) AS IMAGE
		, P.PRODUCT_DESC
		, P.PRICE
		, P.STOCK_NUM
	FROM PRODUCT P
	INNER JOIN PRODUCT_TYPE PT ON P.TYPE_ID = PT.TYPE_ID
	WHERE P.ID IN (%s)
}
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นหาข้อมูล product ตาม id
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchProductById {
	SELECT
		P.ID
		, P.CODE
		, P.PRODUCT_DESC
		, P.PRICE
		, P.STOCK_NUM
		, CONCAT(PT.IMAGE_PATH, '', P.IMAGE_NAME) AS IMAGE
		, PT.TYPE_ID
		, PT.TYPE_DESC
		, PT.SEQ
	FROM PRODUCT P
	INNER JOIN PRODUCT_TYPE PT ON P.TYPE_ID = PT.TYPE_ID
	WHERE P.ID = %s
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ตรวจสอบค่าซ้ำ
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
checkDupCode {
	SELECT COUNT(1) AS TOT
	FROM ORDER_MAIN O
	WHERE O.NO = %s
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : เพิ่มรายการสั่งซื้อ
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
insertOrderMain {
	INSERT INTO ORDER_MAIN (
	  	NO
		,TOTAL_PRICE
	  	,USER_ID
	  	,ORDER_DATE
	) VALUES (
		%s
	  	, %s
	  	, %s
	  	, %s
	 )
}

insertOrderDetail {
	INSERT INTO ORDER_DETAIL(
		PRODUCT_ID
	  	,TOTAL_NUM
	  	,TOTAL_PRICE
	  	,ORDER_ID
	) VALUES (
		%s
	  	, %s
	  	, %s
	  	, %s
	)
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นเลขที่ใบสั่งซื้อ
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchNoById {
	SELECT
		NO
	FROM ORDER_MAIN
	WHERE ID = %s
}
